---
kind: method
id: M:Autodesk.Revit.DB.MEPCalculationServerInfo.Dispose
source: html/d74e5a14-90bf-0f54-d3e5-baa2ee4bc8ca.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.Dispose Method

Releases all resources used by the MEPCalculationServerInfo

## Syntax (C#)
```csharp
public void Dispose()
```